<template>
    <canvas id="plotsChart"></canvas>
</template>

<script>
export default {
    setup() {
        
    },
    mounted(){
        const labels = [
            '04/01','04/09','04/10','04/16','04/19','04/20','04/22','04/28','04/29','04/30','05/01','05/02','05/03','05/04','05/05','05/06','05/07','05/08','05/09','05/10',
            '05/11','05/12','05/13','05/14','05/15','05/16','05/17','05/18','05/19','05/20','05/21','05/22','05/23','05/24','05/25','05/26','05/27','05/28','05/29','05/30',
            '05/31', '06/1'
        ];
        const data = {
            labels: labels,
            datasets: [{
                label: '每天P图量(plots)',
                backgroundColor: 'rgb(255, 99, 132)',
                borderColor: 'rgb(255, 99, 132)',
                data: [3,1,1,1,2,6,6,4,4,4,7,16,48,76,116,110,92,49,60,28,140,228,230,236,234,229,117,241,147,157,203,290,397,323,347,367,322,326,482,576,569, 563],
            }]
        };
        const config = {
            type: 'line',
            data,
            options: {}
        };
        var chart = new Chart(
            document.getElementById('plotsChart'),
            config
        );
    }
}
</script>